RobertoBenjami/stm32_hal_graphics_display_drivers/Drivers/lcd_io_spi_hal.c
//-----------------------------------------------------------------------------
/* Wrtite fill and multi data to Lcd (convert RGB16 bit (5-6-5) to RGB24 bit (8-8-8) mode, no dma capability)
   - pData: RGB 16 bits data pointer
   - Size: data number
   - dinc: 0=fill mode, 1=multidata mode */
void LCDWriteFillMultiData16to24(uint16_t * pData, uint32_t Size, uint32_t Mode)
{
  LcdSpiMode8();

  #if LCD_DMA_TX == 1 && LCD_RGB24_BUFFSIZE > 0
  if(Size > DMA_MINSIZE)
  { /* DMA mode */
    /* SPI TX DMA setting (8bit, multidata) */
    LCD_SPI_HANDLE.hdmatx->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    LCD_SPI_HANDLE.hdmatx->Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    LCD_SPI_HANDLE.hdmatx->Init.MemInc = DMA_MINC_ENABLE;
    HAL_DMA_Init(LCD_SPI_HANDLE.hdmatx);

    dmastatus.maxtrsize = LCD_RGB24_BUFFSIZE;
    dmastatus.size = Size;

    if(Size > LCD_RGB24_BUFFSIZE)
      dmastatus.trsize = LCD_RGB24_BUFFSIZE;
    else
      dmastatus.trsize = Size;

    if(Mode & LCD_IO_FILL)
    { /* fill 16bit to 24bit */
      dmastatus.status = DMA_STATUS_FILL | DMA_STATUS_24BIT;
      FillConvert16to24(*pData, lcd_rgb24_buffer, dmastatus.trsize);
    }
    else
    { /* multidata 16bit to 24bit */
      dmastatus.status = DMA_STATUS_MULTIDATA | DMA_STATUS_24BIT;
      dmastatus.ptr = (uint32_t)pData;
      BitmapConvert16to24(pData, lcd_rgb24_buffer, dmastatus.trsize);
    }

    HAL_SPI_Transmit_DMA(&LCD_SPI_HANDLE, lcd_rgb24_buffer, dmastatus.trsize * 3);
    LcdDmaWaitEnd(Mode & LCD_IO_MULTIDATA);
  }
  else
  #endif
  { /* not DMA mode */
    #if LCD_RGB24_BUFFSIZE == 0
    uint32_t rgb888;
    if(Mode & LCD_IO_FILL)
    { /* fill 16bit to 24bit */
      rgb888 = RGB565TO888(*pData);
      while(Size--)
        HAL_SPI_Transmit(&LCD_SPI_HANDLE, (uint8_t *)&rgb888, 3, LCD_SPI_TIMEOUT);
    }
    else
    { /* multidata 16bit to 24bit */
      while(Size--)
      {
        rgb888 = RGB565TO888(*pData);
        HAL_SPI_Transmit(&LCD_SPI_HANDLE, (uint8_t *)&rgb888, 3, LCD_SPI_TIMEOUT);
        pData++;
      }
    }
    #elif LCD_RGB24_BUFFSIZE > 0
    uint32_t trsize;
    if(Mode & LCD_IO_FILL)
    { /* fill */
      if(Size > LCD_RGB24_BUFFSIZE)
        trsize = LCD_RGB24_BUFFSIZE;
      else
        trsize = Size;
      FillConvert16to24(*pData, lcd_rgb24_buffer, trsize);
      while(Size)
      {
        if(Size > LCD_RGB24_BUFFSIZE)
        {
          trsize = LCD_RGB24_BUFFSIZE;
          Size -= LCD_RGB24_BUFFSIZE;
        }
        else
        {
          trsize = Size;
          Size = 0;
        }
        HAL_SPI_Transmit(&LCD_SPI_HANDLE, lcd_rgb24_buffer, trsize * 3, LCD_SPI_TIMEOUT);
      }
    }
    else
    { /* bitmap */
      while(Size)
      {
        if(Size > LCD_RGB24_BUFFSIZE)
        {
          trsize = LCD_RGB24_BUFFSIZE;
          Size -= LCD_RGB24_BUFFSIZE;
        }
        else
        {
          trsize = Size;
          Size = 0;
        }
        BitmapConvert16to24(pData, lcd_rgb24_buffer, trsize);
        HAL_SPI_Transmit(&LCD_SPI_HANDLE, lcd_rgb24_buffer, trsize * 3, LCD_SPI_TIMEOUT);
        pData += trsize;
      }
    }
    #endif /* #elif LCD_RGB24_BUFFSIZE > 0 */
    HAL_GPIO_WritePin(LCD_CS_GPIO_Port, LCD_CS_Pin, GPIO_PIN_SET);
    LcdTransEnd();
  }
}

//=============================================================================
/* Read */

#if LCD_SPI_MODE != 0

/* RX DMA */
#if LCD_DMA_RX == 1

//-----------------------------------------------------------------------------
/* DMA operation end callback function prototype */
__weak void LCD_IO_DmaRxCpltCallback(SPI_HandleTypeDef *hspi)
{
  UNUSED(hspi);
}

//-----------------------------------------------------------------------------
/* SPI DMA operation interrupt */
void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi)
{
  uint32_t dma_status = dmastatus.status;
  if(hspi == &LCD_SPI_HANDLE)
  {
    #if LCD_RGB24_BUFFSIZE > 0
    if(dma_status == (DMA_STATUS_MULTIDATA | DMA_STATUS_24BIT))
    {
      BitmapConvert24to16(lcd_rgb24_buffer, (uint16_t *)dmastatus.ptr, dmastatus.trsize);
      dmastatus.ptr += dmastatus.trsize << 1; /* 24bit multidata */
    }
    else
    #endif
    {
      if(dma_status == (DMA_STATUS_MULTIDATA | DMA_STATUS_8BIT))
        dmastatus.ptr += dmastatus.trsize;        /* 8bit multidata */
      else if(dma_status == (DMA_STATUS_MULTIDATA | DMA_STATUS_16BIT))
        dmastatus.ptr += dmastatus.trsize << 1; /* 16bit multidata */
    }

    if(dmastatus.size > dmastatus.trsize)
    { /* dma operation is still required */
      dmastatus.size -= dmastatus.trsize;
      if(dmastatus.size <= dmastatus.maxtrsize)
        dmastatus.trsize = dmastatus.size;

      #if LCD_RGB24_BUFFSIZE > 0
      if(dma_status == (DMA_STATUS_MULTIDATA | DMA_STATUS_24BIT))
        HAL_SPI_Receive_DMA(&LCD_SPI_HANDLE, lcd_rgb24_buffer, dmastatus.trsize * 3);
      else
      #endif
        HAL_SPI_Receive_DMA(&LCD_SPI_HANDLE, (uint8_t *)dmastatus.ptr, dmastatus.trsize);
    }
    else
    { /* dma operations have ended */
      HAL_GPIO_WritePin(LCD_CS_GPIO_Port, LCD_CS_Pin, GPIO_PIN_SET);
      LcdDirWrite();
      LcdDmaTransEnd();
      LCD_IO_DmaRxCpltCallback(hspi);
    }
  }
}
#endif  /* #if LCD_DMA_RX == 1 */

//-----------------------------------------------------------------------------
/* Read data from Lcd
   - pData: 8 or 16 bits data pointer
   - Size: data number
   - bitdepth: 0 = 8bit data, 1 = 16bit data */
void LCDReadMultiData8and16(uint8_t * pData, uint32_t Size, uint32_t Mode)
{
  if(Mode & LCD_IO_DATA8)
    LcdSpiMode8();
  else
    LcdSpiMode16();

  #if LCD_DMA_RX == 1
  if((Size > DMA_MINSIZE) && (!LCD_DMA_UNABLE((uint32_t)pData)))
  { /* DMA mode */
    /* SPI RX DMA setting (8bit, multidata) */
    if(Mode & LCD_IO_DATA8)
    {
      LCD_SPI_HANDLE.hdmarx->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
      LCD_SPI_HANDLE.hdmarx->Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
      dmastatus.status = DMA_STATUS_MULTIDATA | DMA_STATUS_8BIT;
    }
    else
    {
      LCD_SPI_HANDLE.hdmarx->Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
      LCD_SPI_HANDLE.hdmarx->Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
      dmastatus.status = DMA_STATUS_MULTIDATA | DMA_STATUS_16BIT;
    }
    LCD_SPI_HANDLE.hdmarx->Init.MemInc = DMA_MINC_ENABLE;
    HAL_DMA_Init(LCD_SPI_HANDLE.hdmarx);

    dmastatus.maxtrsize = DMA_MAXSIZE;
    dmastatus.size = Size;

    if(Size > DMA_MAXSIZE)
      dmastatus.trsize = DMA_MAXSIZE;
    else
      dmastatus.trsize = Size;

